In [9]:
import pandas as pd
import numpy as np
x = [np.nan,1,2,3,4,5]

In [10]:
y = pd.Series([x[np.random.randint(0,6)]for i in range(20)])

In [12]:
print(y.isnull().sum())

5

In [14]:
y.dropna(inplace=True)

In [15]:
print(y)

0     5.0
1     2.0
3     1.0
4     5.0
5     3.0
6     1.0
8     3.0
9     4.0
10    1.0
13    4.0
14    2.0
15    4.0
16    4.0
17    3.0
18    1.0
dtype: float64

In [16]:
print(y.mean())

2.8666666666666667

In [17]:
y.fillna(y.mean())

0     5.0
1     2.0
3     1.0
4     5.0
5     3.0
6     1.0
8     3.0
9     4.0
10    1.0
13    4.0
14    2.0
15    4.0
16    4.0
17    3.0
18    1.0
dtype: float64

# pandas p.11 실습1

In [18]:
import pandas as pd
import numpy as np
x = [np.nan,1,2,3,4,5]
y = pd.Series([x[np.random.randint(0,6)]for i in range(20)])
y

0     2.0
1     4.0
2     4.0
3     4.0
4     NaN
5     4.0
6     2.0
7     NaN
8     2.0
9     1.0
10    3.0
11    3.0
12    4.0
13    3.0
14    3.0
15    1.0
16    1.0
17    5.0
18    4.0
19    4.0
dtype: float64

In [20]:
y.isnull().sum()

2

In [21]:
y.dropna()

0     2.0
1     4.0
2     4.0
3     4.0
5     4.0
6     2.0
8     2.0
9     1.0
10    3.0
11    3.0
12    4.0
13    3.0
14    3.0
15    1.0
16    1.0
17    5.0
18    4.0
19    4.0
dtype: float64

In [23]:
y.mean()

3.0

In [24]:
y.fillna(y.mean())

0     2.0
1     4.0
2     4.0
3     4.0
4     3.0
5     4.0
6     2.0
7     3.0
8     2.0
9     1.0
10    3.0
11    3.0
12    4.0
13    3.0
14    3.0
15    1.0
16    1.0
17    5.0
18    4.0
19    4.0
dtype: float64

In [25]:
y.bfill()

0     2.0
1     4.0
2     4.0
3     4.0
4     4.0
5     4.0
6     2.0
7     2.0
8     2.0
9     1.0
10    3.0
11    3.0
12    4.0
13    3.0
14    3.0
15    1.0
16    1.0
17    5.0
18    4.0
19    4.0
dtype: float64

In [26]:
y[0] = np.nan
y

0     NaN
1     4.0
2     4.0
3     4.0
4     NaN
5     4.0
6     2.0
7     NaN
8     2.0
9     1.0
10    3.0
11    3.0
12    4.0
13    3.0
14    3.0
15    1.0
16    1.0
17    5.0
18    4.0
19    4.0
dtype: float64

In [27]:
y.ffill()

0     NaN
1     4.0
2     4.0
3     4.0
4     4.0
5     4.0
6     2.0
7     2.0
8     2.0
9     1.0
10    3.0
11    3.0
12    4.0
13    3.0
14    3.0
15    1.0
16    1.0
17    5.0
18    4.0
19    4.0
dtype: float64

In [28]:
y[-1] = np.nan
y

 0     NaN
 1     4.0
 2     4.0
 3     4.0
 4     NaN
 5     4.0
 6     2.0
 7     NaN
 8     2.0
 9     1.0
 10    3.0
 11    3.0
 12    4.0
 13    3.0
 14    3.0
 15    1.0
 16    1.0
 17    5.0
 18    4.0
 19    4.0
-1     NaN
dtype: float64

In [29]:
y.bfill()

 0     4.0
 1     4.0
 2     4.0
 3     4.0
 4     4.0
 5     4.0
 6     2.0
 7     2.0
 8     2.0
 9     1.0
 10    3.0
 11    3.0
 12    4.0
 13    3.0
 14    3.0
 15    1.0
 16    1.0
 17    5.0
 18    4.0
 19    4.0
-1     NaN
dtype: float64

In [30]:
sales_data = {
'연도':[2015, 2016, 2017, 2018, 2019, 2020],
'판매량':[103, 70, 130, 160, 190, 230],
'매출':[500000, 300000, 400000, 550000, 700000, 680000],
'순이익':[370000, 190000, 300000, 480000, 600000, 590000]
}
sales_data

{'연도': [2015, 2016, 2017, 2018, 2019, 2020],
 '판매량': [103, 70, 130, 160, 190, 230],
 '매출': [500000, 300000, 400000, 550000, 700000, 680000],
 '순이익': [370000, 190000, 300000, 480000, 600000, 590000]}

In [32]:
df =  pd.DataFrame(sales_data)

In [33]:
df

     연도  판매량      매출     순이익
0  2015  103  500000  370000
1  2016   70  300000  190000
2  2017  130  400000  300000
3  2018  160  550000  480000
4  2019  190  700000  600000
5  2020  230  680000  590000

In [34]:
df.head(2)

     연도  판매량      매출     순이익
0  2015  103  500000  370000
1  2016   70  300000  190000

In [35]:
df.tail(3)

     연도  판매량      매출     순이익
3  2018  160  550000  480000
4  2019  190  700000  600000
5  2020  230  680000  590000

In [37]:
df['판매량']

0    103
1     70
2    130
3    160
4    190
5    230
Name: 판매량, dtype: int64

In [38]:
type(df['판매량'])

pandas.core.series.Series

In [39]:
df.iloc[1]

연도       2016
판매량        70
매출     300000
순이익    190000
Name: 1, dtype: int64

In [40]:
df.iloc[1].index

Index(['연도', '판매량', '매출', '순이익'], dtype='object')

In [44]:
pd.DataFrame(sales_data,columns = ['판매량', '매출', '순이익'],index = df['연도'])

      판매량      매출     순이익
연도
2015  103  500000  370000
2016   70  300000  190000
2017  130  400000  300000
2018  160  550000  480000
2019  190  700000  600000
2020  230  680000  590000

In [43]:
pd.DataFrame(df,columns = ['판매량', '매출', '순이익'])

   판매량      매출     순이익
0  103  500000  370000
1   70  300000  190000
2  130  400000  300000
3  160  550000  480000
4  190  700000  600000
5  230  680000  590000

In [46]:
df = pd.read_csv("sales_data.csv", header = 0)

In [47]:
df

     연도  판매량      매출      순익
0  2015  103  500000  370000
1  2016   70  300000  190000
2  2017  130  400000  300000
3  2018   60  550000  480000
4  2019  190  700000  600000
5  2020  230  680000  590000

In [48]:
df = pd.read_csv("sales_data.csv", index_col = '연도', header= 0)

In [49]:
df

      판매량      매출      순익
연도
2015  103  500000  370000
2016   70  300000  190000
2017  130  400000  300000
2018   60  550000  480000
2019  190  700000  600000
2020  230  680000  590000

In [50]:
df.to_csv('sales_data_save.csv')

In [52]:
df = pd.rea_csv('sales_data_save.csv', encoding = 'utf-8')

AttributeError: module 'pandas' has no attribute 'rea_csv'

In [53]:
sales_data = {
'연도':[2015, 2016, 2017, 2018, 2019, 2020],
'판매량':[103, 70, 130, 160, 190, 230],
'매출':[500000, 300000, 400000, 550000, 700000, 680000],
'순이익':[370000, 190000, 300000, 480000, 600000, 590000]
}
sales_data

{'연도': [2015, 2016, 2017, 2018, 2019, 2020],
 '판매량': [103, 70, 130, 160, 190, 230],
 '매출': [500000, 300000, 400000, 550000, 700000, 680000],
 '순이익': [370000, 190000, 300000, 480000, 600000, 590000]}

In [56]:
df = pd.DataFrame(sales_data)
df

     연도  판매량      매출     순이익
0  2015  103  500000  370000
1  2016   70  300000  190000
2  2017  130  400000  300000
3  2018  160  550000  480000
4  2019  190  700000  600000
5  2020  230  680000  590000

In [58]:
df['순이익률'] = (df['순이익']/df['매출'])*100
df

     연도  판매량      매출     순이익       순이익률
0  2015  103  500000  370000  74.000000
1  2016   70  300000  190000  63.333333
2  2017  130  400000  300000  75.000000
3  2018  160  550000  480000  87.272727
4  2019  190  700000  600000  85.714286
5  2020  230  680000  590000  86.764706

In [59]:
def check(n) :
    if n > 80 :
        return '높음'
    else :
        return '낮음'

In [ ]:
lambda x : '높음' if x > 80  else '낮음'

In [68]:
df['순이익율_비교'] = df['순이익률'].apply(lambda x : '높음' if x > 80  else '낮음')
df

     연도  판매량      매출     순이익       순이익률 순이익율_비교
0  2015  103  500000  370000  74.000000      낮음
1  2016   70  300000  190000  63.333333      낮음
2  2017  130  400000  300000  75.000000      낮음
3  2018  160  550000  480000  87.272727      높음
4  2019  190  700000  600000  85.714286      높음
5  2020  230  680000  590000  86.764706      높음

In [69]:
del df['순이익율_비교']
df

     연도  판매량      매출     순이익       순이익률
0  2015  103  500000  370000  74.000000
1  2016   70  300000  190000  63.333333
2  2017  130  400000  300000  75.000000
3  2018  160  550000  480000  87.272727
4  2019  190  700000  600000  85.714286
5  2020  230  680000  590000  86.764706

In [70]:
df[df['매출']>300000]

     연도  판매량      매출     순이익       순이익률
0  2015  103  500000  370000  74.000000
2  2017  130  400000  300000  75.000000
3  2018  160  550000  480000  87.272727
4  2019  190  700000  600000  85.714286
5  2020  230  680000  590000  86.764706

In [71]:
df['테스트1'] = np.where(df['판매량']>200,0,df['판매량'])

In [73]:
df

     연도  판매량      매출     순이익       순이익률  테스트1
0  2015  103  500000  370000  74.000000   103
1  2016   70  300000  190000  63.333333    70
2  2017  130  400000  300000  75.000000   130
3  2018  160  550000  480000  87.272727   160
4  2019  190  700000  600000  85.714286   190
5  2020  230  680000  590000  86.764706     0

In [74]:
df['테스트2'] = df[df['판매량']<100]['판매량']

In [75]:
df[df['판매량']<100]

     연도  판매량      매출     순이익       순이익률  테스트1  테스트2
1  2016   70  300000  190000  63.333333    70  70.0

In [76]:
df['테스트2'] = df[df['판매량']<100]['판매량']+50

In [77]:
df[df['판매량']<100]['판매량']

1    70
Name: 판매량, dtype: int64

In [78]:
df['테스트2'] = df[df['판매량']<150]['판매량']+50

In [79]:
df[df['판매량']<150]['판매량']

0    103
1     70
2    130
Name: 판매량, dtype: int64

In [80]:
df

     연도  판매량      매출     순이익       순이익률  테스트1   테스트2
0  2015  103  500000  370000  74.000000   103  153.0
1  2016   70  300000  190000  63.333333    70  120.0
2  2017  130  400000  300000  75.000000   130  180.0
3  2018  160  550000  480000  87.272727   160    NaN
4  2019  190  700000  600000  85.714286   190    NaN
5  2020  230  680000  590000  86.764706     0    NaN

In [81]:
df = pd.DataFrame(sales_data)
df

     연도  판매량      매출     순이익
0  2015  103  500000  370000
1  2016   70  300000  190000
2  2017  130  400000  300000
3  2018  160  550000  480000
4  2019  190  700000  600000
5  2020  230  680000  590000

In [82]:
df.loc[6] = [2021,720,650000,720000]
df

     연도  판매량      매출     순이익
0  2015  103  500000  370000
1  2016   70  300000  190000
2  2017  130  400000  300000
3  2018  160  550000  480000
4  2019  190  700000  600000
5  2020  230  680000  590000
6  2021  720  650000  720000

In [83]:
df.loc[7] = df.loc[5] +100
df

     연도  판매량      매출     순이익
0  2015  103  500000  370000
1  2016   70  300000  190000
2  2017  130  400000  300000
3  2018  160  550000  480000
4  2019  190  700000  600000
5  2020  230  680000  590000
6  2021  720  650000  720000
7  2120  330  680100  590100

In [84]:
df['순이익률'] = (df['순이익']/df['매출'])*100
df
df['순이익율_비교'] = df['순이익률'].apply(lambda x : '높음' if x > 80  else '낮음')
df

     연도  판매량      매출     순이익        순이익률 순이익율_비교
0  2015  103  500000  370000   74.000000      낮음
1  2016   70  300000  190000   63.333333      낮음
2  2017  130  400000  300000   75.000000      낮음
3  2018  160  550000  480000   87.272727      높음
4  2019  190  700000  600000   85.714286      높음
5  2020  230  680000  590000   86.764706      높음
6  2021  720  650000  720000  110.769231      높음
7  2120  330  680100  590100   86.766652      높음

In [86]:
del df['순이익율_비교']
df

     연도  판매량      매출     순이익        순이익률
0  2015  103  500000  370000   74.000000
1  2016   70  300000  190000   63.333333
2  2017  130  400000  300000   75.000000
3  2018  160  550000  480000   87.272727
4  2019  190  700000  600000   85.714286
5  2020  230  680000  590000   86.764706
6  2021  720  650000  720000  110.769231
7  2120  330  680100  590100   86.766652

In [93]:
df.drop(['순이익률'], axis = 'columns')
df

     연도  판매량      매출     순이익        순이익률
0  2015  103  500000  370000   74.000000
1  2016   70  300000  190000   63.333333
2  2017  130  400000  300000   75.000000
3  2018  160  550000  480000   87.272727
4  2019  190  700000  600000   85.714286
5  2020  230  680000  590000   86.764706
6  2021  720  650000  720000  110.769231
7  2120  330  680100  590100   86.766652

In [96]:
df.drop(df.columns[[0,2]],axis = 1)

   판매량     순이익        순이익률
0  103  370000   74.000000
1   70  190000   63.333333
2  130  300000   75.000000
3  160  480000   87.272727
4  190  600000   85.714286
5  230  590000   86.764706
6  720  720000  110.769231
7  330  590100   86.766652

In [97]:
df.drop (0,inplace=True)

In [98]:
df

     연도  판매량      매출     순이익        순이익률
1  2016   70  300000  190000   63.333333
2  2017  130  400000  300000   75.000000
3  2018  160  550000  480000   87.272727
4  2019  190  700000  600000   85.714286
5  2020  230  680000  590000   86.764706
6  2021  720  650000  720000  110.769231
7  2120  330  680100  590100   86.766652

In [99]:
df.drop (0,inplace=True)
df
# 인덱스 0 이 없기 때문에 에러가 뜸(이전에 인덱스 0을 지웠기 때문)

KeyError: '[0] not found in axis'

In [100]:
df = pd.DataFrame(np.random.randint(1,100,size=(4,4)), index = [['A','A','B','B'],['a','a','b','b']],columns = [['가가','가가','나나','나나'],['가','나','가','나']])

In [101]:
df

     가가      나나
      가   나   가   나
A a  90  32  91  44
  a  70  73  54  25
B b  64  84  64   8
  b  72  81  62  52

In [102]:
df.index

MultiIndex([('A', 'a'),
            ('A', 'a'),
            ('B', 'b'),
            ('B', 'b')],
           )

In [103]:
df.columns

MultiIndex([('가가', '가'),
            ('가가', '나'),
            ('나나', '가'),
            ('나나', '나')],
           )

In [104]:
df = pd.DataFrame(np.random.randint(1,100, size=(15,3)),index = [['1학년','1학년','1학년','1학년','1학년','2학년','2학년','2학년','2학년','2학년','3학년','3학년','3학년','3학년','3학년'],['1반','2반','3반','4반','5반','1반','2반','3반','4반','5반','1반','2반','3반','4반','5반']],columns=['국어','영어','과학'])
df

        국어  영어  과학
1학년 1반  53  63  55
    2반  58  32   7
    3반   5  73  66
    4반   5  50  51
    5반  73  70   3
2학년 1반  91  99  71
    2반  20  77  32
    3반  57  88  72
    4반  71   9  67
    5반  84  44   1
3학년 1반  23  49  42
    2반  68   3  96
    3반  24  56  14
    4반  80  23  72
    5반  64  90   3

In [110]:
df_sum = pd.DataFrame(df)

sum = df['국어']+df['영어']+df['과학']
sum

1학년  1반    171
     2반     97
     3반    144
     4반    106
     5반    146
2학년  1반    261
     2반    129
     3반    217
     4반    147
     5반    129
3학년  1반    114
     2반    167
     3반     94
     4반    175
     5반    157
dtype: int32

In [128]:
df_sum['총점'] = sum
df_sum

        국어  영어  과학   총점
1학년 1반  53  63  55  171
    2반  58  32   7   97
    3반   5  73  66  144
    4반   5  50  51  106
    5반  73  70   3  146
2학년 1반  91  99  71  261
    2반  20  77  32  129
    3반  57  88  72  217
    4반  71   9  67  147
    5반  84  44   1  129
3학년 1반  23  49  42  114
    2반  68   3  96  167
    3반  24  56  14   94
    4반  80  23  72  175
    5반  64  90   3  157

In [120]:
df_mean = pd.DataFrame(df)

mean= df_sum['총점']/3
mean

1학년  1반    57.000000
     2반    32.333333
     3반    48.000000
     4반    35.333333
     5반    48.666667
2학년  1반    87.000000
     2반    43.000000
     3반    72.333333
     4반    49.000000
     5반    43.000000
3학년  1반    38.000000
     2반    55.666667
     3반    31.333333
     4반    58.333333
     5반    52.333333
Name: 총점, dtype: float64

In [130]:
df_sum['평균'] = mean

In [138]:
df_sum

        국어  영어  과학   총점         평균
학년  반
1학년 1반  53  63  55  171  57.000000
    2반  58  32   7   97  32.333333
    3반   5  73  66  144  48.000000
    4반   5  50  51  106  35.333333
    5반  73  70   3  146  48.666667
2학년 1반  91  99  71  261  87.000000
    2반  20  77  32  129  43.000000
    3반  57  88  72  217  72.333333
    4반  71   9  67  147  49.000000
    5반  84  44   1  129  43.000000
3학년 1반  23  49  42  114  38.000000
    2반  68   3  96  167  55.666667
    3반  24  56  14   94  31.333333
    4반  80  23  72  175  58.333333
    5반  64  90   3  157  52.333333

In [139]:
df.index.names = ['학년','반']

In [142]:
df_1 = df_sum.groupby('학년').sum()


df_1

      국어   영어   과학   총점          평균
학년
1학년  194  288  182  664  221.333333
2학년  323  317  243  883  294.333333
3학년  259  221  227  707  235.666667

In [186]:
import pandas as pd
import numpy as np

titanic = pd.read_csv('titanic_train.csv')

In [187]:
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [160]:
pd.date_range(start = '2019-01-10', end = '2019-01-17')

DatetimeIndex(['2019-01-10', '2019-01-11', '2019-01-12', '2019-01-13',
               '2019-01-14', '2019-01-15', '2019-01-16', '2019-01-17'],
              dtype='datetime64[ns]', freq='D')

In [161]:
for date in pd.date_range(start = '2019-01-10', end = '2019-01-17') :
    print(date)

2019-01-10 00:00:00
2019-01-11 00:00:00
2019-01-12 00:00:00
2019-01-13 00:00:00
2019-01-14 00:00:00
2019-01-15 00:00:00
2019-01-16 00:00:00
2019-01-17 00:00:00

In [169]:
table_data1 = {
    'A' : [1,2,3,4,5],
    'B' : [10,20,30,40,50],
    'C' : [100,200,300,400,500]
}

df1 = pd.DataFrame(table_data1)
df1

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

In [170]:
table_data2 = {
    'A' : [6,7,8],
    'B' : [60,70,80],
    'C' : [600,700,800]
}
df2 = pd.DataFrame(table_data2)
df2

   A   B    C
0  6  60  600
1  7  70  700
2  8  80  800

In [171]:
df1 + df2

      A      B       C
0   7.0   70.0   700.0
1   9.0   90.0   900.0
2  11.0  110.0  1100.0
3   NaN    NaN     NaN
4   NaN    NaN     NaN

In [173]:
import pandas as pd
import numpy as np
df1 = pd.DataFrame({'Class1' : [94,92,98,100],
                  'Class2' : [91,93,97,99]})
df1

   Class1  Class2
0      94      91
1      92      93
2      98      97
3     100      99

In [174]:
df2 = pd.DataFrame({'Class1' : [87,89],
                   'Class2' : [85,90]})
df2

   Class1  Class2
0      87      85
1      89      90

In [175]:
df1.append(df2)

   Class1  Class2
0      94      91
1      92      93
2      98      97
3     100      99
0      87      85
1      89      90

In [176]:
df1.append(df2, ignore_index=True)

   Class1  Class2
0      94      91
1      92      93
2      98      97
3     100      99
4      87      85
5      89      90

In [177]:
df3 = pd.DataFrame({'Class1' : [96,83]})
df3

   Class1
0      96
1      83

In [178]:
df2.append(df3, ignore_index=True)

   Class1  Class2
0      87    85.0
1      89    90.0
2      96     NaN
3      83     NaN

In [179]:
df4 = pd.DataFrame({'Class3' : [93,91,95,98]})
df4

   Class3
0      93
1      91
2      95
3      98

In [180]:
df1.join(df4)

   Class1  Class2  Class3
0      94      91      93
1      92      93      91
2      98      97      95
3     100      99      98

In [181]:
df_A_B = pd.DataFrame({'판매월' : ['1월','2월','3월','4월'],
                      '제품 A' : [100,150,200,250],
                      '제품 B' : [90,110,140,170]})
df_A_B

  판매월  제품 A  제품 B
0  1월   100    90
1  2월   150   110
2  3월   200   140
3  4월   250   170

In [183]:
df_C_D = pd.DataFrame({'판매월' : ['1월','2월','3월','4월'],
                      '제품 C' : [112,130,120,160],
                      '제품 D' : [90,123,10,102]})
df_C_D

  판매월  제품 C  제품 D
0  1월   112    90
1  2월   130   123
2  3월   120    10
3  4월   160   102

In [184]:
df_A_B.merge(df_C_D)

  판매월  제품 A  제품 B  제품 C  제품 D
0  1월   100    90   112    90
1  2월   150   110   130   123
2  3월   200   140   120    10
3  4월   250   170   160   102